Revit 2024 API
DetailElementOrderUtils.IsDetailElement Method
 Indicates if the element is a detail element that participates in detail draw ordering in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsDetailElement(
	Document document,
	View view,
	ElementId detailElementId
)
Visual Basic
Public Shared Function IsDetailElement ( _
	document As Document, _
	view As View, _
	detailElementId As ElementId _
) As Boolean
Visual C++
public:
static bool IsDetailElement(
	Document^ document,
	View^ view,
	ElementId^ detailElementId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
view
Type: Autodesk.Revit.DB.View
 The view in which the detail appears.
detailElementId
Type: Autodesk.Revit.DB.ElementId
 The detail element.
Return Value
 True if the detail element is orderable in the view, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DetailElementOrderUtils Class
Autodesk.Revit.DB Namespace